#1'. Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
#и проверяет, является ли этот день выходным.
#*Пример:*

#- 6 -> да
#- 7 -> да
#- 1 -> нет

import os
os.system('cls||clear')

a = int(input())
if a == 1 or a == 2 or a == 3 or a == 4 or a == 5:
    print ('Не является выходным днем')
if a == 6 or a == 7:
    print ('Является выходным днем')
if a == 0 or a > 7:
    print ('Значение введено не верно')

